# L = ['Micheal', 'Sarah', 'Tracy', 'Bob', 'Jacky']
# # [L[0], L[2], L[4]]
# newl = []
# for i in L:
#     newl.append(i)

    # L[IndexStart,IndexEnd]截取开始索引到结束索引之间前（不包括结束索引）的元素
    #     # L[-2] 取倒数第二个元素
    #     # L[-2:] 取从倒数第二个元素开始到最后的元素
    #     # L[-2:-1]  取倒数第二个元素开始到倒数第一个元素结束（不包括倒数第一）
    #     # L[:10]  取前10个元素
    #     # L[-10:] 取后10个元素
    #     # L[10:20] 取前10到20个元素
    #     # L[:15:2] 前15个元素，每两个取一个
    #     # L[::5] 所有元素每5个取1个
    #     # L[:] 复制一个list
    #     # tuple 也可以进行切片 (1, 2, 3)
    #     # 'abcd' 字符串也可以堪称list切割

